RIET/src/Documents/TemporaryImpExpTransactions/TemporaryImpExpTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TemporaryImpExpTransactions</name>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfTemporaryImpExpTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFileNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NewResponsible</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAJobReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShipperName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsRegime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>NewCustomsFileNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>Qty</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileLineNo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/TypesOfTemporaryImpExpTransaction/TypesOfTemporaryImpExpTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfTemporaryImpExpTransaction</name>
  <enumValues>
    <name>TemporaryImport</name>
  </enumValues>
  <enumValues>
    <name>TemporaryExport</name>
  </enumValues>
  <enumValues>
    <name>Prolongation</name>
  </enumValues>
  <enumValues>
    <name>ResponsibleChange</name>
  </enumValues>
  <enumValues>
    <name>Reexport</name>
  </enumValues>
  <enumValues>
    <name>Reimport</name>
  </enumValues>
  <enumValues>
    <name>PermanentImport</name>
  </enumValues>
  <enumValues>
    <name>PermanentExport</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/TemporaryImpExpTransactions/Forms/ФормаПодбораItems/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьДляВыбораИзTemporaryImportTransaction(Параметры.СтруктураНастройки);
	
	Отбор = Параметры.Отбор;
	
	Если НЕ Отбор.Свойство("ПометкаУдаления") Тогда
		Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзTemporaryImportTransaction(СтруктураНастройки)
	
	// Установим параметры
	ПараметрыСписка = Список.Параметры;
	Если ЗначениеЗаполнено(СтруктураНастройки.TemporaryImportTransaction) Тогда
		ПараметрыСписка.УстановитьЗначениеПараметра("Дата", СтруктураНастройки.TemporaryImportTransaction.МоментВремени());
	Иначе
		ПараметрыСписка.УстановитьЗначениеПараметра("Дата", СтруктураНастройки.TransactionDate);
	КонецЕсли;
	
	ПараметрыСписка.УстановитьЗначениеПараметра("Регистратор", СтруктураНастройки.TemporaryImportTransaction);
	
	// Установим отборы
	Отбор = Параметры.Отбор;
	
	ProcessLevelCountry = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(СтруктураНастройки.ProcessLevel, "Country");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.Отбор,
		"SoldTo.Country",
		ВидСравненияКомпоновкиДанных.Равно,
		ProcessLevelCountry);
	
	Если СтруктураНастройки.TypeOfTransaction = Перечисления.TypesOfTemporaryImpExpTransaction.TemporaryImport
		ИЛИ СтруктураНастройки.TypeOfTransaction = Перечисления.TypesOfTemporaryImpExpTransaction.TemporaryExport Тогда
		
		Отбор.Вставить("Invoice", Документы.Инвойс.ПустаяСсылка());
		Отбор.Вставить("ExportRequest", Документы.ExportRequest.ПустаяСсылка());
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			Список.Отбор,
			"QtyInTemporaryImport",
			ВидСравненияКомпоновкиДанных.Больше,
			0);
		
		Если СтруктураНастройки.TypeOfTransaction = Перечисления.TypesOfTemporaryImpExpTransaction.ResponsibleChange Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				Список.Отбор,
				"Responsible",
				ВидСравненияКомпоновкиДанных.НеРавно,
				СтруктураНастройки.NewResponsible);
			
		Иначе
				
			Отбор.Вставить("CustomsFileNo", СтруктураНастройки.CustomsFileNo);
			
		КонецЕсли;
				
	КонецЕсли;
	
	Если СтруктураНастройки.AlreadySelectedItems.Количество() > 0 Тогда
		
		СписокAlreadySelectedItems = Новый СписокЗначений;
		СписокAlreadySelectedItems.ЗагрузитьЗначения(СтруктураНастройки.AlreadySelectedItems);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			Список.Отбор,
			"Ссылка",
			ВидСравненияКомпоновкиДанных.НеВСписке,
			СписокAlreadySelectedItems);
			
	КонецЕсли;
	
КонецПроцедуры
